{
  "Id": "12345678-1234-1234-1234-123456789012",
  "DisplayName": "Require MFA for all users",
  "State": "Enabled",
  "CreatedDateTime": "2024-01-01T12:00:00Z",
  "ModifiedDateTime": "2024-05-01T10:30:00Z",
  "Conditions": {
    "Applications": {
      "IncludeApplications": ["All"],
      "ExcludeApplications": [],
      "IncludeUserActions": [],
      "IncludeAuthenticationContextClassReferences": []
    },
    "Users": {
      "IncludeUsers": ["All"],
      "ExcludeUsers": [],
      "IncludeGroups": [],
      "ExcludeGroups": [],
      "IncludeRoles": [],
      "ExcludeRoles": []
    },
    "ClientAppTypes": ["all"],
    "Platforms": {
      "IncludePlatforms": [],
      "ExcludePlatforms": []
    },
    "Locations": {
      "IncludeLocations": [],
      "ExcludeLocations": []
    },
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "ClientApplications": {
      "IncludeServicePrincipals": [],
      "ExcludeServicePrincipals": []
    }
  },
  "GrantControls": {
    "Operator": "OR",
    "BuiltInControls": ["mfa"],
    "CustomAuthenticationFactors": [],
    "TermsOfUse": [],
    "AuthenticationStrength": null
  },
  "SessionControls": {
    "ApplicationEnforcedRestrictions": null,
    "CloudAppSecurity": null,
    "PersistentBrowser": null,
    "SignInFrequency": null
  }
}