







{
  "DisplayName": "High-risk application protection",
  "State": "Enabled",
  "Conditions": {
    "Applications": {
      "IncludeApplications": [
        "{{HIGH_RISK_APP_1_ID}}",
        "{{HIGH_RISK_APP_2_ID}}",
        "{{HIGH_RISK_APP_3_ID}}"
      ],
      "ExcludeApplications": [],
      "IncludeUserActions": [],
      "IncludeAuthenticationContextClassReferences": []
    },
    "Users": {
      "IncludeUsers": ["All"],
      "ExcludeUsers": [
        "{{EMERGENCY_ACCESS_ACCOUNT_1}}",
        "{{EMERGENCY_ACCESS_ACCOUNT_2}}"
      ],
      "IncludeGroups": [],
      "ExcludeGroups": [],
      "IncludeRoles": [],
      "ExcludeRoles": []
    },
    "ClientAppTypes": ["All"],
    "Platforms": {
      "IncludePlatforms": [],
      "ExcludePlatforms": []
    },
    "Locations": {
      "IncludeLocations": [],
      "ExcludeLocations": []
    },
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "ClientApplications": {
      "IncludeServicePrincipals": [],
      "ExcludeServicePrincipals": []
    }
  },
  "GrantControls": {
    "Operator": "AND",
    "BuiltInControls": ["mfa", "compliantDevice"],
    "CustomAuthenticationFactors": [],
    "TermsOfUse": ["{{TERMS_OF_USE_ID}}"]
  },
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": true
    },
    "CloudAppSecurity": {
      "IsEnabled": true,
      "CloudAppSecurityType": "blockDownloads"
    },
    "PersistentBrowser": {
      "IsEnabled": true,
      "Mode": "never"
    },
    "SignInFrequency": {
      "Value": 4,
      "Type": "hours",
      "IsEnabled": true
    }
  }
}







