
{
  "DisplayName": "Block legacy authentication",
  "State": "Enabled",
  "Conditions": {
    "Applications": {
      "IncludeApplications": ["All"],
      "ExcludeApplications": [],
      "IncludeUserActions": [],
      "IncludeAuthenticationContextClassReferences": []
    },
    "Users": {
      "IncludeUsers": ["All"],
      "ExcludeUsers": [
        "{{EMERGENCY_ACCESS_ACCOUNT_1}}",
        "{{EMERGENCY_ACCESS_ACCOUNT_2}}"
      ],
      "IncludeGroups": [],
      "ExcludeGroups": [],
      "IncludeRoles": [],
      "ExcludeRoles": []
    },
    "ClientAppTypes": ["exchangeActiveSync", "other"],
    "Platforms": {
      "IncludePlatforms": [],
      "ExcludePlatforms": []
    },
    "Locations": {
      "IncludeLocations": [],
      "ExcludeLocations": []
    },
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "ClientApplications": {
      "IncludeServicePrincipals": [],
      "ExcludeServicePrincipals": []
    }
  },
  "GrantControls": {
    "Operator": "OR",
    "BuiltInControls": ["block"],
    "CustomAuthenticationFactors": [],
    "TermsOfUse": []
  },
  "SessionControls": {
    "ApplicationEnforcedRestrictions": null,
    "CloudAppSecurity": null,
    "PersistentBrowser": null,
    "SignInFrequency": null
  }
}

