{
  "ExportedAt": "2025-05-30T19:40:15.3409694Z",
  "TenantId": "d3850203-7ac5-4601-91ee-7d6caacc5f4a",
  "PoliciesCount": 1,
  "Policies": [
    {
      "Id": "70ce03fa-054a-48b3-ab0f-081d292cfa59",
      "DisplayName": "notrustisrael",
      "State": "Enabled",
      "CreatedDateTime": "2021-04-26T15:41:04.755541+00:00",
      "Conditions": {
        "Applications": {
          "IncludeApplications": [
            "All"
          ],
          "ExcludeApplications": [],
          "IncludeUserActions": [],
          "IncludeAuthenticationContextClassReferences": []
        },
        "Users": {
          "IncludeUsers": [
            "7c86af9e-38ac-4cc3-9482-d31caae8e213"
          ],
          "ExcludeUsers": [],
          "IncludeGroups": [],
          "ExcludeGroups": [],
          "IncludeRoles": [],
          "ExcludeRoles": []
        },
        "ClientAppTypes": [
          0
        ],
        "Platforms": {},
        "Locations": {},
        "SignInRiskLevels": [],
        "UserRiskLevels": [],
        "ClientApplications": {}
      },
      "GrantControls": {
        "Operator": "OR",
        "BuiltInControls": [
          1
        ],
        "CustomAuthenticationFactors": [],
        "TermsOfUse": []
      },
      "SessionControls": {}
    }
  ]
}