{
  "DisplayName": "Allow access only from corporate network",
  "State": "Enabled",
  "Conditions": {
    "Applications": {
      "IncludeApplications": [
        "{{SENSITIVE_APP_1_ID}}",
        "{{SENSITIVE_APP_2_ID}}"
      ],
      "ExcludeApplications": [],
      "IncludeUserActions": [],
      "IncludeAuthenticationContextClassReferences": []
    },
    "Users": {
      "IncludeUsers": ["All"],
      "ExcludeUsers": [
        "{{EMERGENCY_ACCESS_ACCOUNT_1}}",
        "{{EMERGENCY_ACCESS_ACCOUNT_2}}"
      ],
      "IncludeGroups": [],
      "ExcludeGroups": ["{{REMOTE_WORKERS_GROUP_ID}}"],
      "IncludeRoles": [],
      "ExcludeRoles": []
    },
    "ClientAppTypes": ["All"],
    "Platforms": {
      "IncludePlatforms": [],
      "ExcludePlatforms": []
    },
    "Locations": {
      "IncludeLocations": [
        "{{CORPORATE_OFFICE_LOCATION_ID}}",
        "{{DATACENTER_LOCATION_ID}}"
      ],
      "ExcludeLocations": []
    },
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "ClientApplications": {
      "IncludeServicePrincipals": [],
      "ExcludeServicePrincipals": []
    }
  },
  "GrantControls": {
    "Operator": "OR",
    "BuiltInControls": ["block"],
    "CustomAuthenticationFactors": [],
    "TermsOfUse": []
  },
  "SessionControls": {
    "ApplicationEnforcedRestrictions": null,
    "CloudAppSecurity": null,
    "PersistentBrowser": null,
    "SignInFrequency": null
  }
}
