

{
  "DisplayName": "Admin protection - Require MFA and compliant device",
  "State": "Enabled",
  "Conditions": {
    "Applications": {
      "IncludeApplications": ["All"],
      "ExcludeApplications": [],
      "IncludeUserActions": [],
      "IncludeAuthenticationContextClassReferences": []
    },
    "Users": {
      "IncludeUsers": [],
      "ExcludeUsers": [
        "{{EMERGENCY_ACCESS_ACCOUNT_1}}",
        "{{EMERGENCY_ACCESS_ACCOUNT_2}}"
      ],
      "IncludeGroups": [],
      "ExcludeGroups": [],
      "IncludeRoles": [
        "62e90394-69f5-4237-9190-012177145e10",
        "194ae4cb-b126-40b2-bd5b-6091b380977d",
        "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
        "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
        "158c047a-c907-4556-b7ef-446551a6b5f7"
      ],
      "ExcludeRoles": []
    },
    "ClientAppTypes": ["All"],
    "Platforms": {
      "IncludePlatforms": [],
      "ExcludePlatforms": []
    },
    "Locations": {
      "IncludeLocations": [],
      "ExcludeLocations": []
    },
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "ClientApplications": {
      "IncludeServicePrincipals": [],
      "ExcludeServicePrincipals": []
    }
  },
  "GrantControls": {
    "Operator": "AND",
    "BuiltInControls": ["mfa", "compliantDevice"],
    "CustomAuthenticationFactors": [],
    "TermsOfUse": []
  },
  "SessionControls": {
    "ApplicationEnforcedRestrictions": null,
    "CloudAppSecurity": null,
    "PersistentBrowser": null,
    "SignInFrequency": {
      "Value": 4,
      "Type": "hours",
      "IsEnabled": true
    }
  }
}

