




{
  "DisplayName": "Service account protection",
  "State": "Enabled",
  "Conditions": {
    "Applications": {
      "IncludeApplications": ["All"],
      "ExcludeApplications": [],
      "IncludeUserActions": [],
      "IncludeAuthenticationContextClassReferences": []
    },
    "Users": {
      "IncludeUsers": [],
      "ExcludeUsers": [],
      "IncludeGroups": ["{{SERVICE_ACCOUNTS_GROUP_ID}}"],
      "ExcludeGroups": [],
      "IncludeRoles": [],
      "ExcludeRoles": []
    },
    "ClientAppTypes": ["All"],
    "Platforms": {
      "IncludePlatforms": [],
      "ExcludePlatforms": []
    },
    "Locations": {
      "IncludeLocations": ["{{DATACENTER_LOCATION_ID}}"],
      "ExcludeLocations": []
    },
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "ClientApplications": {
      "IncludeServicePrincipals": [],
      "ExcludeServicePrincipals": []
    }
  },
  "GrantControls": {
    "Operator": "OR",
    "BuiltInControls": ["block"],
    "CustomAuthenticationFactors": [],
    "TermsOfUse": []
  },
  "SessionControls": {
    "ApplicationEnforcedRestrictions": null,
    "CloudAppSecurity": null,
    "PersistentBrowser": null,
    "SignInFrequency": null
  }
}




